# 算数运算符： + - * / // % **
#
# print("10 + 4 = ", 10 + 4)  # 加
# print("10 - 4 = ", 10 - 4)  # 减
# print("10 * 4 = ", 10 * 4)  # 乘
# print("10 / 4 = ", 10 / 4)  # 除
# print("10 // 4 = ", 10 // 4)  # 整除（结果为整数）
# print("10 % 4 = ", 10 % 4)  # 取余/求模
# print("10 ** 4 = ", 10 ** 4)  # 幂指数，10的4次方
#
# # 算数运算符的优先级 --> ** --> * / // % --> + -
# print("0.1 + 10 / 4 ** 2 = ", 0.1 + 10 / 4 ** 2)

# 案例： 输入两个数x和y，计算x + y 以及 x -y 的结果并输出
# # float(..) ---> 将其他类型转为浮点数类型
# x = int(input("请输入x的值："))
# y = int(input("请输入y的值："))
#
# print(x + y)
# print(x - y)


# # - 案例1：计算输入的三个整数的平均数
# x = int(input("请输入x的值："))
# y = int(input("请输入y的值："))
# z = int(input("请输入z的值："))
#
# p = x + y + z
#
# print((x + y + z) / 3)
#
# print(p / 3)

# - 案例2：要求输入梯形的上底、下底、高，然后计算梯形的面积


# s = int(input("请输入上底的值："))
# x = int(input("请输入下底的值："))
# h = int(input("请输入高的值："))
#
# print((s + x) * h / 2)

# - 案例3：要求输入圆的半径，然后计算圆的周长和面积（周长：2πr，面积：πr²）

# r = float(input("请输入半径的值："))
# p = 3.1415926
#
# print(f"圆的周长是：{2 * p * r}")
#
# print(f"圆的面积是：{p * r ** 2}")

# 案例4：身体质量指数BMI的计算（BMI = 体重(kg) / 身高(m)²）
# 1. 输入体重（单位kg）
# 2. 输入身高（单位m）
# 3. 计算身体质量指数BMI并输出

# 身体质量指数BMI的计算（BMI = 体重(kg) / 身高(m)²）

# 1. 输入身高（单位：米）
# h = float(input("请输入身高（单位：米）："))
#
# # 2. 输入体重（单位：千克）
# w = float(input("请输入体重（单位：千克）："))
#
# # 3. 计算并输出BMI
# bmi = w / (h ** 2)
# print(f"身体质量指数BMI是：{bmi:.2f}")  # 保留两位小数
#
# if bmi < 18.5:
#     print("体重过轻")
# elif 18.5 <= bmi < 24:
#     print("正常范围")
# elif 24 <= bmi < 28:
#     print("超重")
# else:
#     print("肥胖")

## 赋值运算符

num = 85

num += 10  # num = num + 10
print("num += 10 后,num=", num)

num -= 10
print("num -= 10 后,num=", num)

num *= 10
print("num *= 10 后,num=", num)

num /= 10
print("num /= 10 后,num=", num)

num //= 10
print("num //= 10 后,num=", num)

num %= 3
print("num %= 3 后,num=", num)

num **= 3
print("num **= 3 后,num=", num)

## 比较运算符

print("100 == 100吗：", 100 == 100)

print("'100'=='100'吗：", "100" == "100")

print("100 !=100吗：", 100 != 100)

print("100 < 100吗：", 100 < 100)

print("100 <= 100吗：", 100 <= 100)

print("100 > 100吗：", 100 > 100)
print("100 >= 100吗：", 100 >= 100)

## 逻辑运算符


# 需求1：键盘输入一个整数，判断这个数字是否在10-20之间。

n = int(input("请输入一个整数:"))

print(f"{n}在10-20之间：", n >= 10 and n <= 20)  # and连接的条件是并且的关系，两个条件同时成立（true），结果才是true；否则fALSE

# print(f"{n}在10-20之间：", 10 <= n <= 20)


# 需求2：键盘输入一个整数，判断这个数字是否不在10-20之间。
n = int(input("请输入一个整数:"))
print(f"{n}在10-20之间：", n < 10 or n > 20)  # or 连接的条件，是或者关系，只要其中有一个成立（true），结果就是true，否则false
